<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Geetest
    |--------------------------------------------------------------------------
    | 填写注册Geetest时在后台提供的id和key
    |
    */

    'id'  => "",
    'key' => "",

    /**
     *--------------------------------------------------------------------------
     * 验证路由
     *--------------------------------------------------------------------------
     * Geetest初始化时，会请求该url
     * 一般情况下不用修改，当然，如果你要修改也是可以的
     * invoke不能填写回调，只能填写"ClassName@method"或者"ClassName"的字符串
     */

	'path'   => 'geetest/start',
	'invoke' => 'Shuangz\Geetest\Controller@start',

    /**
     *----------------------------------------------------------------------
     * 认证类型
     *-----------------------------------------------------------------------
     *  web:电脑上的浏览器；
     *  h5:手机上的浏览器，包括移动应用内完全内置的web_view；
     *  native：通过原生SDK植入APP应用的方式
     */
    'client_type' => 'web'

];
